micropython/micropython/ports/stm32/adc.c
    #if defined(TIM6)
    if (mp_obj_is_integer(freq_in)) {
        // stop timer if we initialised TIM6 in this function (legacy behaviour)
        HAL_TIM_Base_Stop(tim);
    }
    #endif

    return mp_obj_new_int(bufinfo.len);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(adc_read_timed_obj, adc_read_timed);

/// \method read_timed_multi((adcx, adcy, ...), (bufx, bufy, ...), timer)
///
/// Read analog values from multiple ADC's into `buf` at a rate set by the
/// `timer` object. Each ADC has its own buffer. Can be used to extract
/// relative timing or phase data. All buffers must be of the same type and
/// length.
///
/// Buffers can be bytearray or array.array for example. The ADC values have
/// 12-bit resolution and are stored directly into `buf` if its element size is
/// 16 bits or greater.  If buffers have only 8-bit elements (eg a bytearray)
/// then the sample resolution will be reduced to 8 bits.
///
/// `timer` should be a Timer object, and a sample from each ADC is read each
/// time the timer triggers.  The timer must already be initialised and running
/// at the desired sampling frequency.
///
/// Example reading three ADC's:
///
///     adc0 = pyb.ADC(pyb.Pin.board.X1)    # Create ADC's
///     adc1 = pyb.ADC(pyb.Pin.board.X2)
///     adc2 = pyb.ADC(pyb.Pin.board.X3)
///     tim = pyb.Timer(8, freq=100)        # Create timer
///     rx0 = array.array('H', (0 for i in range(100)))  # ADC buffers of
///     rx1 = array.array('H', (0 for i in range(100)))  # 100 16-bit words
///     rx2 = array.array('H', (0 for i in range(100)))
///     # read analog values into buf at 100Hz (takes one second)
///     pyb.ADC.read_timed_multi((adc0, adc1, adc2), (rx0, rx1, rx2), tim)
///     for n in range(len(rx0)):
///         print(rx0[n], rx1[n], rx2[n])
///
/// This function does not allocate any memory.

STATIC mp_obj_t adc_read_timed_multi(mp_obj_t adc_array_in, mp_obj_t buf_array_in, mp_obj_t tim_in) {
    size_t nadcs, nbufs;
    mp_obj_t *adc_array, *buf_array;
    mp_obj_get_array(adc_array_in, &nadcs, &adc_array);
    mp_obj_get_array(buf_array_in, &nbufs, &buf_array);

    if (nadcs != nbufs) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError,
            "length of buffer list and ADC list differ"));
    }
    if (nadcs < 1) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError,
            "must specify at least 1 ADC"));
    }

    // Get buf for first ADC. Get word size. Check other buffers match.
    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(buf_array[0], &bufinfo, MP_BUFFER_WRITE);
    size_t typesize = mp_binary_get_size('@', bufinfo.typecode, NULL);
    for (uint array_index = 0; array_index < nbufs; array_index++) {
        mp_buffer_info_t bufinfo_curr;
        mp_get_buffer_raise(buf_array[array_index], &bufinfo_curr, MP_BUFFER_WRITE);
        if ((bufinfo.len != bufinfo_curr.len) || (bufinfo.typecode != bufinfo_curr.typecode)) {
            nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError,
                "size and type of buffers must match"));
        }
    }

    // use the supplied timer object as the sampling time base
    TIM_HandleTypeDef *tim;
    tim = pyb_timer_get_handle(tim_in);

    // Start adc. This is slow so wait for it to start.
    pyb_obj_adc_t *adc0 = adc_array[0];
    adc_config_channel(&adc0->handle, adc0->channel);
    HAL_ADC_Start(&adc0->handle);
    // wait for sample to complete and discard
    #define READ_TIMED_TIMEOUT (10) // in ms
    adc_wait_for_eoc_or_timeout(READ_TIMED_TIMEOUT);
    // read (and discard) value
    uint value = ADCx->DR;

    // Ensure first sample is on a timer tick
    __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);
    while (__HAL_TIM_GET_FLAG(tim, TIM_FLAG_UPDATE) == RESET) {
        }
    __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);

    // Overrun check: assume success.
    uint success = 1;
    uint nelems = bufinfo.len / typesize;
    for (uint elem_index = 0; elem_index < nelems; elem_index++) {
        if (__HAL_TIM_GET_FLAG(tim, TIM_FLAG_UPDATE) != RESET) {
            // Timer has already triggered.
            success = 0;
        } else {
            // Wait for the timer to trigger so we sample at the correct frequency
            while (__HAL_TIM_GET_FLAG(tim, TIM_FLAG_UPDATE) == RESET) {
            }
        }
        __HAL_TIM_CLEAR_FLAG(tim, TIM_FLAG_UPDATE);

        for (uint array_index = 0; array_index < nadcs; array_index++) {
            pyb_obj_adc_t *adc = adc_array[array_index];
            // configure the ADC channel
            adc_config_channel(&adc->handle, adc->channel);
            // for the first sample we need to turn the ADC on
            // ADC is started: set the "start sample" bit
#if defined(MCU_SERIES_F4) || defined(MCU_SERIES_F7)
            ADCx->CR2 |= (uint32_t)ADC_CR2_SWSTART;
#elif defined(MCU_SERIES_L4)
            SET_BIT(ADCx->CR, ADC_CR_ADSTART);
#else
            #error Unsupported processor
#endif
            // wait for sample to complete
            #define READ_TIMED_TIMEOUT (10) // in ms
            adc_wait_for_eoc_or_timeout(READ_TIMED_TIMEOUT);

            // read value
            value = ADCx->DR;

            // store values in buffer
            if (typesize == 1) {
                value >>= 4;
            }
            mp_buffer_info_t bufinfo_curr;  // Get buf for current ADC
            mp_get_buffer_raise(buf_array[array_index], &bufinfo_curr, MP_BUFFER_WRITE);
            mp_binary_set_val_array_from_int(bufinfo_curr.typecode, bufinfo_curr.buf, elem_index, value);
        }
    }

    // turn the ADC off
    adc0 = adc_array[0];
    HAL_ADC_Stop(&adc0->handle);
    return mp_obj_new_bool(success);
}

STATIC MP_DEFINE_CONST_FUN_OBJ_3(adc_read_timed_multi_fun_obj, adc_read_timed_multi);

//STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(adc_read_timed_multi_fun_obj, 3, 3, adc_read_timed_multi);
STATIC MP_DEFINE_CONST_STATICMETHOD_OBJ(adc_read_timed_multi_obj, MP_ROM_PTR(&adc_read_timed_multi_fun_obj));

STATIC const mp_rom_map_elem_t adc_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&adc_read_obj) },
    { MP_ROM_QSTR(MP_QSTR_read_timed), MP_ROM_PTR(&adc_read_timed_obj) },
    { MP_ROM_QSTR(MP_QSTR_read_timed_multi), MP_ROM_PTR(&adc_read_timed_multi_obj) },
};

STATIC MP_DEFINE_CONST_DICT(adc_locals_dict, adc_locals_dict_table);

const mp_obj_type_t pyb_adc_type = {
    { &mp_type_type },
    .name = MP_QSTR_ADC,
    .print = adc_print,
    .make_new = adc_make_new,
    .locals_dict = (mp_obj_dict_t*)&adc_locals_dict,
};

/******************************************************************************/
/* adc all object                                                             */

typedef struct _pyb_adc_all_obj_t {
    mp_obj_base_t base;
    ADC_HandleTypeDef handle;
} pyb_adc_all_obj_t;

void adc_init_all(pyb_adc_all_obj_t *adc_all, uint32_t resolution, uint32_t en_mask) {

